''' 2. Написати функцію < bank > , яка працює за наступною логікою: користувач робить вклад у розмірі < a > одиниць строком на < years > років під < percents > відсотків (кожен рік сума вкладу збільшується на цей відсоток, ці гроші додаються до суми вкладу і в наступному році на них також нараховуються відсотки). Параметр < percents > є необов'язковим і має значення по замовчуванню < 10 > (10%). Функція повинна принтануть і вернуть суму, яка буде на рахунку.
'''
def bank(a, year, percents=10):
    for year_n in range(year):
        a += a/100*10
    print (a)
    return a
    
user_cash = float(input('$ = '))
user_year = int(input('year = '))
bank(user_cash, user_year)

